       IDENTIFICATION DIVISION.
       PROGRAM-ID. MON-PROG.  
       DATA DIVISION.     
       WORKING-STORAGE SECTION.
       01  NOMDEP.
           03 FILLER PIC X(52) VALUE 
           '001Ain                    Auvergne-Rhone-Alpes      '.
           03 FILLER PIC X(52) VALUE 
           '002Aisne                  Hauts-de-France           '.
           03 FILLER PIC X(52) VALUE 
           '003Allier                 Auvergne-Rhone-Alpes      '.
           03 FILLER PIC X(52) VALUE 
           '004Alpes-de-Haute-ProvenceProvence-Alpes-Cote d Azur'.
           03 FILLER PIC X(52) VALUE 
           '005Hautes-Alpes           Provence-Alpes-Cote d Azur'.
           03 FILLER PIC X(52) VALUE 
           '006Alpes-Maritimes        Provence-Alpes-Cote d Azur'.
           03 FILLER PIC X(52) VALUE 
           '007Ardeche                Auvergne-Rhone-Alpes      '.
           03 FILLER PIC X(52) VALUE 
           '008Ardennes               Grand Est                 '.
           03 FILLER PIC X(52) VALUE 
           '009Ariege                 Occitanie                 '.
           03 FILLER PIC X(52) VALUE 
           '010Aube                   Grand Est                 '.
           03 FILLER PIC X(52) VALUE 
           '011Aude                   Occitanie                 '.
           03 FILLER PIC X(52) VALUE 
           '012Aveyron                Occitanie                 '.
           03 FILLER PIC X(52) VALUE 
           '001Ain                    Auvergne-Rhone-Alpes      '.
           03 FILLER PIC X(52) VALUE 
           '002Aisne                  Hauts-de-France           '.
           03 FILLER PIC X(52) VALUE 
           '003Allier                 Auvergne-Rhone-Alpes      '.
           03 FILLER PIC X(52) VALUE 
           '004Alpes-de-Haute-ProvenceProvence-Alpes-Cote d Azur'.
           03 FILLER PIC X(52) VALUE 
           '005Hautes-Alpes           Provence-Alpes-Cote d Azur'.
           03 FILLER PIC X(52) VALUE 
           '006Alpes-Maritimes        Provence-Alpes-Cote d Azur'.
           03 FILLER PIC X(52) VALUE 
           '007Ardeche                Auvergne-Rhone-Alpes      '.
           03 FILLER PIC X(52) VALUE 
           '008Ardennes               Grand Est                 '.
           03 FILLER PIC X(52) VALUE 
           '009Ariege                 Occitanie                 '.
           03 FILLER PIC X(52) VALUE 
           '010Aube                   Grand Est                 '.
           03 FILLER PIC X(52) VALUE 
           '011Aude                   Occitanie                 '.
           03 FILLER PIC X(52) VALUE 
           '012Aveyron                Occitanie                 '.
           03 FILLER PIC X(52) VALUE 
           '013Bouches-du-Rhone       Provence-Alpes-Cote d Azur'.
           03 FILLER PIC X(52) VALUE 
           '014Calvados               Normandie                 '.
           03 FILLER PIC X(52) VALUE 
           '015Cantal                 Auvergne-Rhone-Alpes      '.
           03 FILLER PIC X(52) VALUE 
           '016Charente               Nouvelle-Aquitaine        '.
           03 FILLER PIC X(52) VALUE 
           '017Charente-Maritime      Nouvelle-Aquitaine        '.
           03 FILLER PIC X(52) VALUE 
           '018Cher                   Centre-Val de Loire       '.
           03 FILLER PIC X(52) VALUE 
           '019Correze                Nouvelle-Aquitaine        '.
           03 FILLER PIC X(52) VALUE 
           '02ACorse-du-Sud           Corse                     '.
           03 FILLER PIC X(52) VALUE 
           '02BHaute-Corse            Corse                     '.
           03 FILLER PIC X(52) VALUE 
           '021Cote-d Or              Bourgogne-Franche-Comte   '.
           03 FILLER PIC X(52) VALUE 
           '022Cotes d Armor          Bretagne                  '.
           03 FILLER PIC X(52) VALUE 
           '023Creuse                 Nouvelle-Aquitaine        '.
           03 FILLER PIC X(52) VALUE 
           '024Dordogne               Nouvelle-Aquitaine        '.
           03 FILLER PIC X(52) VALUE 
           '025Doubs                  Bourgogne-Franche-Comte   '.
           03 FILLER PIC X(52) VALUE 
           '026Drome                  Auvergne-Rhone-Alpes      '.
           03 FILLER PIC X(52) VALUE 
           '027Eure                   Normandie                 '.
           03 FILLER PIC X(52) VALUE 
           '028Eure-et-Loir           Centre-Val de Loire       '.
           03 FILLER PIC X(52) VALUE 
           '029Finistere              Bretagne                  '.
           03 FILLER PIC X(52) VALUE 
           '030Gard                   Occitanie                 '.
           03 FILLER PIC X(52) VALUE 
           '031Haute-Garonne          Occitanie                 '.
           03 FILLER PIC X(52) VALUE 
           '032Gers                   Occitanie                 '.
           03 FILLER PIC X(52) VALUE 
           '033Gironde                Nouvelle-Aquitaine        '.
           03 FILLER PIC X(52) VALUE 
           '034Herault                Occitanie                 '.
           03 FILLER PIC X(52) VALUE 
           '035Ille-et-Vilaine        Bretagne                  '.
           03 FILLER PIC X(52) VALUE 
           '036Indre                  Centre-Val de Loire       '.
           03 FILLER PIC X(52) VALUE 
           '037Indre-et-Loire         Centre-Val de Loire       '.
           03 FILLER PIC X(52) VALUE 
           '038Isere                  Auvergne-Rhone-Alpes      '.
           03 FILLER PIC X(52) VALUE 
           '039Jura                   Bourgogne-Franche-Comte   '.
           03 FILLER PIC X(52) VALUE 
           '040Landes                 Nouvelle-Aquitaine        '.
           03 FILLER PIC X(52) VALUE 
           '041Loir-et-Cher           Centre-Val de Loire       '.
           03 FILLER PIC X(52) VALUE 
           '042Loire                  Auvergne-Rhone-Alpes      '.
           03 FILLER PIC X(52) VALUE 
           '043Haute-Loire            Auvergne-Rhone-Alpes      '.
           03 FILLER PIC X(52) VALUE 
           '044Loire-Atlantique       Pays de la Loire          '.
           03 FILLER PIC X(52) VALUE 
           '045Loiret                 Centre-Val de Loire       '.
           03 FILLER PIC X(52) VALUE 
           '046Lot                    Occitanie                 '.
           03 FILLER PIC X(52) VALUE 
           '047Lot-et-Garonne         Nouvelle-Aquitaine        '.
           03 FILLER PIC X(52) VALUE 
           '048Lozere                 Occitanie                 '.
           03 FILLER PIC X(52) VALUE 
           '049Maine-et-Loire         Pays de la Loire          '.
           03 FILLER PIC X(52) VALUE 
           '050Manche                 Normandie                 '.
           03 FILLER PIC X(52) VALUE 
           '051Marne                  Grand Est                 '.
           03 FILLER PIC X(52) VALUE 
           '052Haute-Marne            Grand Est                 '.
           03 FILLER PIC X(52) VALUE 
           '053Mayenne                Pays de la Loire          '.
           03 FILLER PIC X(52) VALUE 
           '054Meurthe-et-Moselle     Grand Est                 '.
           03 FILLER PIC X(52) VALUE 
           '055Meuse                  Grand Est                 '.
           03 FILLER PIC X(52) VALUE 
           '056Morbihan               Bretagne                  '.
           03 FILLER PIC X(52) VALUE 
           '057Moselle                Grand Est                 '.
           03 FILLER PIC X(52) VALUE 
           '058Nievre                 Bourgogne-Franche-Comte   '.
           03 FILLER PIC X(52) VALUE 
           '059Nord                   Hauts-de-France           '.
           03 FILLER PIC X(52) VALUE 
           '060Oise                   Hauts-de-France           '.
           03 FILLER PIC X(52) VALUE 
           '061Orne                   Normandie                 '.
           03 FILLER PIC X(52) VALUE 
           '062Pas-de-Calais          Hauts-de-France           '.
           03 FILLER PIC X(52) VALUE 
           '063Puy-de-Dome            Auvergne-Rhone-Alpes      '.
           03 FILLER PIC X(52) VALUE 
           '064Pyrenees-Atlantiques   Nouvelle-Aquitaine        '.
           03 FILLER PIC X(52) VALUE 
           '065Hautes-Pyrenees        Occitanie                 '.
           03 FILLER PIC X(52) VALUE 
           '066Pyrenees-Orientales    Occitanie                 '.
           03 FILLER PIC X(52) VALUE 
           '067Bas-Rhin               Grand Est                 '.
           03 FILLER PIC X(52) VALUE 
           '068Haut-Rhin              Grand Est                 '.
           03 FILLER PIC X(52) VALUE 
           '069Rhone                  Auvergne-Rhone-Alpes      '.
           03 FILLER PIC X(52) VALUE 
           '070Haute-Saone            Bourgogne-Franche-Comte   '.
           03 FILLER PIC X(52) VALUE 
           '071Saone-et-Loire         Bourgogne-Franche-Comte   '.
           03 FILLER PIC X(52) VALUE 
           '072Sarthe                 Pays de la Loire          '.
           03 FILLER PIC X(52) VALUE 
           '073Savoie                 Auvergne-Rhone-Alpes      '.
           03 FILLER PIC X(52) VALUE 
           '074Haute-Savoie           Auvergne-Rhone-Alpes      '.
           03 FILLER PIC X(52) VALUE 
           '075Paris                  Ile-de-France             '.
           03 FILLER PIC X(52) VALUE 
           '076Seine-Maritime         Normandie                 '.
           03 FILLER PIC X(52) VALUE 
           '077Seine-et-Marne         Ile-de-France             '.
           03 FILLER PIC X(52) VALUE 
           '078Yvelines               Ile-de-France             '.
           03 FILLER PIC X(52) VALUE 
           '079Deux-Sevres            Nouvelle-Aquitaine        '.
           03 FILLER PIC X(52) VALUE 
           '080Somme                  Hauts-de-France           '.
           03 FILLER PIC X(52) VALUE 
           '081Tarn                   Occitanie                 '.
           03 FILLER PIC X(52) VALUE 
           '082Tarn-et-Garonne        Occitanie                 '.
           03 FILLER PIC X(52) VALUE 
           '083Var                    Provence-Alpes-Cote d Azur'.
           03 FILLER PIC X(52) VALUE 
           '084Vaucluse               Provence-Alpes-Cote d Azur'.
           03 FILLER PIC X(52) VALUE 
           '085Vendee                 Pays de la Loire          '.
           03 FILLER PIC X(52) VALUE 
           '086Vienne                 Nouvelle-Aquitaine        '.
           03 FILLER PIC X(52) VALUE 
           '087Haute-Vienne           Nouvelle-Aquitaine        '.
           03 FILLER PIC X(52) VALUE 
           '088Vosges                 Grand Est                 '.
           03 FILLER PIC X(52) VALUE 
           '089Yonne                  Bourgogne-Franche-Comte   '.
           03 FILLER PIC X(52) VALUE 
           '090Territoire-de-Belfort  Bourgogne-Franche-Comte   '.
           03 FILLER PIC X(52) VALUE 
           '091Essonne                Ile-de-France             '.
           03 FILLER PIC X(52) VALUE 
           '092Hauts-de-Seine         Ile-de-France             '.
           03 FILLER PIC X(52) VALUE 
           '093Seine-Saint-Denis      Ile-de-France             '.
           03 FILLER PIC X(52) VALUE 
           '094Val-de-Marne           Ile-de-France             '.
           03 FILLER PIC X(52) VALUE 
           '095Val-D Oise             Ile-de-France             '.
           03 FILLER PIC X(52) VALUE 
           '971Guadeloupe             Guadeloupe                '.
           03 FILLER PIC X(52) VALUE 
           '972Martinique             Martinique                '.
           03 FILLER PIC X(52) VALUE 
           '973Guyane                 Guyane                    '.
           03 FILLER PIC X(52) VALUE 
           '974La Reunion             La Reunion                '.
           03 FILLER PIC X(52) VALUE 
           '976Mayotte                Mayotte                   '.

       
       01  WS-DEP REDEFINES NOMDEP.
              10 WS-NOM-DEP OCCURS 101 INDEXED BY WS-INDEX.
                 12 WS-NUM-DEP PIC X(3).
                 12 WS-DEPT PIC X(23).
                 12 WS-REGION PIC X(26).
              
       01  rechnumerodep pic X(3).
       PROCEDURE DIVISION.
           ACCEPT rechnumerodep.
 
           search WS-NOM-DEP at end display 'region introuvable'
               when WS-NUM-DEP(WS-INDEX) = rechnumerodep
                   display 'Found num'
           end-search
           DISPLAY WS-DEPT(WS-INDEX).
           STOP RUN.
